import i18n from "i18next";
import { initReactI18next } from "react-i18next";

const resources = {
  ua: {
    translation: {
      "main-title": "Галас Олексій",
      "first-btn": "Технології",
      "second-btn": "Мої проекти",

      "slider-title": "Мій стек технологій",

      "development-title": "Розробка сайту",

      "html-description": "Щоб створити структуру сайту, ми використовуємо мову гіпертекстової розмітки HTML5, вона дає нам можливість створити текст, зображення, відео та інше на сайті.",
      "css-description": "Щоб стилізувати всю структуру, яку ми створили, використовуємо мову стилізації CSS3, за допомогою якої ми стилізуємо наш сайт і робимо його красивим з точки зору дизайну.",
      "js-description": "Жоден сайт у сучасному світі не обходиться без мови програмування JAVASCRIPT, яка створена для того, щоб створювати інтерактивність на сайті. За допомогою неї створюються модальні вікна, таби для переключення контенту на сайті, відправка інформації та форм на сервер, а також основна інтерактивність.",
      "react-description": "І для того, щоб створити класний і оптимізований сайт, ми використовуємо бібліотеку-фреймворк REACT, яка дає нам можливість створювати якісні та круті сайти з тих технологій, що описані вище. Цей фреймворк необов'язковий, якщо сайт спочатку планується невеликим за розміром і ресурсами.",

      "works-title": "Мої роботи",
      "tab-website": "Веб-додатки (SPA)",
      "tab-app": "Веб-додатки",

      "store": "NBStore - це невеликий магазин одягу, розроблений з використанням React і сучасних бібліотек для спрощення розробки та поліпшення користувацького досвіду.",
      "pizza": "NextPizza - це повнофункціональний фулстек-додаток, розроблений на React (з його екосистемою) і Express.js (з Mongoose і MongoDB). Проєкт повністю завершений і дає змогу користувачам замовляти різні піци.",
      "crypto": "Crypto - це веб-додаток для відстеження інформації про криптовалюти. Проєкт розроблено з використанням React, TypeScript і Tailwind CSS. У ньому я попрактикував свої навички роботи з різними API для отримання актуальних даних про криптовалюти та їхні зміни.",
      "weather": "Простий веб-додаток по погоді, створений за допомогою чистого React, дає змогу отримати прогноз погоди в місті, яке користувач вкаже, і надасть додаткову інформацію про швидкість вітру тощо.",

      "questions-title": "FAQ або відповіді на питання",
      "questions-first": "Чому варто працювати саме зі мною?",
      "questions-second": "Яку роботу виконує фронтенд-розробник?",
      "questions-third": "Які продукти я розробляю?",
      "questions-four": "Скільки часу займає розробка?",
      "questions-five": "Ціна за готовий продукт",

      "questions-first-answer": "У мене дуже відповідальне ставлення до своєї роботи, і якщо я за щось беруся, то завжди намагаюся довести справу до кінця, оскільки моя задача — отримати об’єктивний відгук від замовника. Також ви завжди можете звернутися до мене у разі будь-якої проблеми або питання, оскільки я на зв’язку 24/7.",
      "questions-second-answer": "Фронтенд-розробник створює з нуля інтерфейс будь-якого сайту. Окрім дизайну, створюється ще й передача даних, взаємодія з контентом, кросплатформеність (щоб сайт працював у всіх браузерах) та багато іншого.",
      "questions-third-answer": "На даний момент я можу створювати невеликі лендінги та сайти-візитки для вашого бізнесу, а також можу взятися за розробку інтернет-магазинів.",
      "questions-four-answer": "Щоб зрозуміти, скільки часу займе розробка того чи іншого продукту, потрібно визначити його обсяг. Прості сайти можуть займати від 7 до 14 днів, а розробка інтернет-магазинів обговорюється окремо.",

      "burger-menu__main": "Головна",
      "burger-menu__dev": "Разробка сайтів",
      "burger-menu__works": "Мої роботи",
      "burger-menu__stek": "Мій стек",

      "language": 'Мова',
      
      "link": "Посилання",

      "footer-main": 'Головна',
      "footer-stek": 'Стек',
      "footer-dev": 'Розробка',
      "footer-works": 'Роботи'
    }
  },
  ru: {
    translation: {
      "main-title": "Галас Алексей",
      "first-btn": "Технологии",
      "second-btn": "Мои проекты",

      "slider-title": "Мой стек технологий",

      "development-title": "Разработка сайта",
      "html-description": "Чтобы создать структуру сайта, мы используем язык гипертекстовой разметки HTML5, он даёт нам возможность создать текст, изображения, видео и прочее на сайте.",
      "css-description": "Чтобы стилизовать всю структуру, которую мы создали, используем язык стилизации CSS3. С его помощью мы стилизуем наш сайт и делаем его красивым с точки зрения дизайна.",
      "js-description": "Ни один сайт в современном мире не обходится без языка программирования JAVASCRIPT, созданного для того, чтобы создавать интерактивность на сайте. С помощью него создаются модальные окна, табы для переключения контента на сайте, отправка информации и форм на сервер, а также основная интерактивность.",
      "react-description": "И для того чтобы создать классный и оптимизированный сайт, мы используем библиотеку-фреймворк REACT, она даёт нам возможность создавать качественные и крутые сайты из тех технологий, что описаны выше. Этот фреймворк необязателен, если сайт изначально планируется небольшим по размеру и ресурсам.",

      "works-title": "Мои работы",
      "tab-website": "Веб-приложения (SPA)",
      "tab-app": "Веб-приложения",

      "store": "NBStore — это небольшой магазин одежды, разработанный с использованием React и современных библиотек для упрощения разработки и улучшения пользовательского опыта.",
      "pizza": "NextPizza — это полнофункциональное фуллстек-приложение, разработанное на React (с его экосистемой) и Express.js (с Mongoose и MongoDB). Проект полностью завершен и позволяет пользователям заказывать различные пиццы.",
      "crypto": "Crypto — это веб-приложение для отслеживания информации о криптовалютах. Проект разработан с использованием React, TypeScript и Tailwind CSS. В нём я попрактиковал свои навыки работы с различными API для получения актуальных данных о криптовалютах и их изменениях.",
      "weather": "Простое веб-приложение по погоде созданное с помощью чистого React, позволяет получить прогноз погоды по городу который пользователь укажет и предоставит доп. информацию о скорости ветра и т.д",

      "questions-title": "FAQ или ответы на вопросы",
      "questions-first": "Почему стоит работать именно со мной?",
      "questions-second": "Какую работу выполняет фронтенд-разработчик?",
      "questions-third": "Какие продукты я разрабатываю?",
      "questions-four": "Сколько по времени занимает разработка?",
      "questions-five": "Цена за готовый продукт",

      "questions-first-answer": "У меня очень ответственное отношение к своей работе, и если я за что-то берусь, то всегда стараюсь довести дело до конца, так как моя задача — получить объективный фидбек от заказчика. Также ко мне всегда можно обратиться в случае какой-либо проблемы или вопроса, так как я на связи 24/7.",
      "questions-second-answer": "Фронтенд-разработчик создаёт с нуля интерфейс любого сайта. Помимо дизайна, осуществляется отправка данных, взаимодействие с контентом, кроссплатформенность (чтобы сайт работал во всех браузерах) и многое другое.",
      "questions-third-answer": "В данный момент я могу создавать небольшие лендинги и сайты-визитки для вашего бизнеса, а также могу взяться за разработку интернет-магазина.",
      "questions-four-answer": "Чтобы понять, сколько времени займёт разработка того или иного продукта, нужно понять, что именно нужно разработать. Простые сайты могут занимать от 7 до 14 дней, а интернет-магазины обсуждаются отдельно.",

      "burger-menu__main": "Главная",
      "burger-menu__dev": "Разработка сайта",
      "burger-menu__works": "Мои работы",
      "burger-menu__stek": "Мой стек",

      "language": "Язык",

      "link": "Ссылка",

      "footer-main": 'Главная',
      "footer-stek": 'Стек',
      "footer-dev": 'Разработка',
      "footer-works": 'Работы'
    }
  }
};

i18n
  .use(initReactI18next) // passes i18n down to react-i18next
  .init({
    resources,
    lng: "ru",

    interpolation: {
      escapeValue: false // react already safes from xss
    }
  });

export default i18n;